In [1]:
import pandas as pd

In [16]:
pwd

'C:\\Users\\saleemh\\Downloads\\Py-DS-ML-Bootcamp-master (1)\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

In [17]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [18]:
df = pd.read_csv('example')

In [19]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [20]:
df.to_csv('My_output', index=False)

In [21]:
pd.read_excel('Excel_Sample.xlsx','Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [22]:
df.to_excel('Excel_Sample2.xlsx', 'NewSheet')

In [2]:
from bs4 import BeautifulSoup

In [25]:
from sqlalchemy import create_engine

In [26]:
engine = create_engine('sqlite:///:memory:')

In [27]:
df.to_sql('data', engine)

4

In [28]:
sql_df = pd.read_sql('data',con=engine)

In [29]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15